tap "felixkratz/formulae"
tap "koekeishiya/formulae"
brew "stow"
brew "automake"
brew "bash"
brew "bat"
brew "bc"
brew "btop"
brew "portaudio"
brew "coreutils"
brew "eza"
brew "fastfetch"
brew "fd"
brew "ffmpeg"
brew "fnm"
brew "fzf"
brew "gawk"
brew "ghostscript"
brew "git"
brew "gh"
brew "gnu-sed"
brew "hexyl"
brew "htop"
brew "libtool"
brew "imagemagick"
brew "jq"
brew "lazygit"
brew "luarocks"
brew "neovim"
brew "node"
brew "nowplaying-cli"
brew "poppler"
brew "reattach-to-user-namespace"
brew "resvg"
brew "ripgrep"
brew "sevenzip"
brew "starship"
brew "tag"
brew "tailscale", restart_service: :changed
brew "tlrc"
brew "tmux"
brew "tree"
brew "uv"
brew "wget"
brew "yazi"
brew "zoxide"
brew "felixkratz/formulae/borders"
cask "bartender"
cask "claude-code"
cask "font-comic-shanns-mono-nerd-font"
cask "font-hack-nerd-font"
cask "font-symbols-only-nerd-font"
cask "iina"
cask "iterm2"
cask "karabiner-elements"
cask "keycastr"
cask "miniconda"
cask "orbstack"
cask "raycast"
cask "visual-studio-code"
vscode "catppuccin.catppuccin-vsc"
vscode "catppuccin.catppuccin-vsc-icons"
vscode "github.copilot-chat"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.remote-explorer"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "tomoki1207.pdf"
vscode "vscodevim.vim"
uv "kimi-cli"
